app/views/planner/new.html.erb

SELECT `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`category_id` = 4
---
<script type="text/javascript">
    Ink.requireModules([
        'Ink.UI.Draggable_1',
        'Ink.UI.Droppable_1',
        'Ink.UI.Toggle_1',
        'Ink.Dom.Loaded_1',
        'Ink.Dom.Event_1',
        'Ink.Dom.Selector_1'], function (Draggable, Droppable, Toggle, Loaded, InkEvent, Selector) {
//          COURSE FROM PLAN ADD

        <% @courses.each do |c| %>
        new Draggable('#<%=c.id%>-CCD li', {onEnd: function() {
            if (document.getElementById('<%=c.id%>-B')) {
                $('#<%=c.id%>-B').css("background", "rgba(255, 255, 255, 0.5) none repeat scroll 0 0");
                $('#<%=c.id%>-B').css("color", "black");
                $('#<%=c.id%>-B').css("border-style", "dashed");
                $('#<%=c.id%>-B').css("box-shadow", "none");
            } else {
                $('#<%=c.sub_category.name%>-B').css("background", "rgba(255, 255, 255, 0.5) none repeat scroll 0 0");
                $('#<%=c.sub_category.name%>-B').css("color", "black");
                $('#<%=c.sub_category.name%>-B').css("box-shadow", "none");
                $('#<%=c.sub_category.name%>-B').css("border-style", "dashed");