app/views/planner/show.html.erb

                                        clearClassCards();
                                        <% c.sub_category.courses.each do |cc| %>
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`sub_category_id` = 5