app/controllers/academics_controller.rb

SELECT `schools`.* FROM `schools`
SELECT `departments`.* FROM `departments`
SELECT `majors`.* FROM `majors`
SELECT `catalogs`.* FROM `catalogs`
---
  def new
    @user = current_user
    @school = School.all
    @dep = Department.all
    @major = Major.all
    @catalog = Catalog.all

INSERT INTO `academics` (`user_id`, `school_id`, `department_id`, `major_id`, `catalog_id`, `created_at`, `updated_at`) VALUES (1, 1, 1, 1, 1, '2016-04-16 20:18:29', '2016-04-16 20:18:29')
---
  def create
    @user = current_user
    @academic = Academic.new()
    @academic[:user_id] = @user[:id]
    @academic[:school_id] = academic_params[:school_id]
    @academic[:department_id] = academic_params[:department_id]
    @academic[:major_id] = academic_params[:major_id]
    @academic[:catalog_id] = academic_params[:catalog_id]
    if @academic.save