app/controllers/planner_controller.rb

  def new
    if  !logged_in?
      redirect_to login_path
    else
      @academic = Academic.where(:user_id => current_user.id)
      if @academic.empty?
        redirect_to academics_new_path
      else
        @academic = @academic.take
        @school = School.find(@academic.school_id)
        @major = Major.find(@academic.major_id)
        @catalog = Catalog.find(@academic.catalog_id)
---
SELECT  `academics`.* FROM `academics` WHERE `academics`.`user_id` = 1 LIMIT 1
SELECT COUNT(*) FROM `academics` WHERE `academics`.`user_id` = 1
SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 1 LIMIT 1
SELECT  `majors`.* FROM `majors` WHERE `majors`.`id` = 1 LIMIT 1
SELECT  `catalogs`.* FROM `catalogs` WHERE `catalogs`.`id` = 1 LIMIT 1

  def show
    if  !logged_in?
      redirect_to login_path
    else
      @academic = Academic.where(:user_id => current_user.id)
      if @academic.empty?
        redirect_to academics_new_path
      else
        @academic = @academic.take
        @school = School.find(@academic.school_id)
        @major = Major.find(@academic.major_id)
        @catalog = Catalog.find(@academic.catalog_id)
        @courses = @catalog.courses

        @plans = SavedPlan.where(:major => @major.name).all

        @plan = SavedPlan.find(params[:id])
        @semester = @plan.semesters
        @sem_courses = []
        @semester.each do |sem|
          sem.courses.each do |c|
---
SELECT  `academics`.* FROM `academics` WHERE `academics`.`user_id` = 1 LIMIT 1
SELECT COUNT(*) FROM `academics` WHERE `academics`.`user_id` = 1
SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 1 LIMIT 1
SELECT  `majors`.* FROM `majors` WHERE `majors`.`id` = 1 LIMIT 1
SELECT  `catalogs`.* FROM `catalogs` WHERE `catalogs`.`id` = 1 LIMIT 1
SELECT  `saved_plans`.* FROM `saved_plans` WHERE `saved_plans`.`id` = 1 LIMIT 1
SELECT `courses`.* FROM `courses` INNER JOIN `plans` ON `courses`.`id` = `plans`.`course_id` WHERE `plans`.`catalog_id` = 1