app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `status`, `password_digest`, `created_at`, `updated_at`) VALUES ('Alice', 'alice@testing.com', 'S', '$2a$10$Hrh9suU84dQb83hCOy.Ydufyc0vXldb.dsRwe7zpghubH0t2gXpr.', '2016-04-16 20:18:27', '2016-04-16 20:18:27')
---
  	def create
  		@user = User.new(user_params)
  		if @user.save